Revit 2024 API
TransactionGroup Properties
The TransactionGroup type exposes the following members.
Properties
Name | Description
IsFailureHandlingForcedModal
 Forces all transactions finished inside this group to use modal failure handling regardless of what failure handling options are set for those transactions.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
TransactionGroup Class
Autodesk.Revit.DB Namespace